In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame({
    'col1' : [1,2,3,4,5],
    'col2' : [45,56,67,34,34],
    'col3' : [6,7,8,9,10],
    'col4' : "kunj inteturon one tech in".split(),
    'col5' : "i am studing data science".split()
})

In [5]:
df

   col1  col2  col3       col4     col5
0     1    45     6       kunj        i
1     2    56     7  inteturon       am
2     3    67     8        one  studing
3     4    34     9       tech     data
4     5    34    10         in  science

In [6]:
"my name is kunj".split()

['my', 'name', 'is', 'kunj']

In [7]:
df['col6'] = df['col3']**2

In [8]:
df['col6']

0     36
1     49
2     64
3     81
4    100
Name: col6, dtype: int64

In [9]:
df

   col1  col2  col3       col4     col5  col6
0     1    45     6       kunj        i    36
1     2    56     7  inteturon       am    49
2     3    67     8        one  studing    64
3     4    34     9       tech     data    81
4     5    34    10         in  science   100

In [10]:
df['col7'] = df['col4'].str[0]
df['col7']

0    k
1    i
2    o
3    t
4    i
Name: col7, dtype: object

In [11]:
df

   col1  col2  col3       col4     col5  col6 col7
0     1    45     6       kunj        i    36    k
1     2    56     7  inteturon       am    49    i
2     3    67     8        one  studing    64    o
3     4    34     9       tech     data    81    t
4     5    34    10         in  science   100    i

In [12]:
def test(a):
    return a**2

In [13]:
test(2)

4

In [14]:
df['col8'] = df['col1'].apply(test)

In [15]:
df

   col1  col2  col3       col4     col5  col6 col7  col8
0     1    45     6       kunj        i    36    k     1
1     2    56     7  inteturon       am    49    i     4
2     3    67     8        one  studing    64    o     9
3     4    34     9       tech     data    81    t    16
4     5    34    10         in  science   100    i    25

In [16]:
def test1(a):
    if a=='j':
        return 'j'
    else:
        return 'z'

In [17]:
df['col9'] = df['col7'].apply(test1)

In [18]:
df['col9']

0    z
1    z
2    z
3    z
4    z
Name: col9, dtype: object

In [19]:
df

   col1  col2  col3       col4     col5  col6 col7  col8 col9
0     1    45     6       kunj        i    36    k     1    z
1     2    56     7  inteturon       am    49    i     4    z
2     3    67     8        one  studing    64    o     9    z
3     4    34     9       tech     data    81    t    16    z
4     5    34    10         in  science   100    i    25    z

In [20]:
df

   col1  col2  col3       col4     col5  col6 col7  col8 col9
0     1    45     6       kunj        i    36    k     1    z
1     2    56     7  inteturon       am    49    i     4    z
2     3    67     8        one  studing    64    o     9    z
3     4    34     9       tech     data    81    t    16    z
4     5    34    10         in  science   100    i    25    z

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    5 non-null      int64
 1   col2    5 non-null      int64
 2   col3    5 non-null      int64
 3   col4    5 non-null      object
 4   col5    5 non-null      object
 5   col6    5 non-null      int64
 6   col7    5 non-null      object
 7   col8    5 non-null      int64
 8   col9    5 non-null      object
dtypes: int64(5), object(4)
memory usage: 488.0+ bytes

In [22]:
df.describe()

           col1       col2       col3        col6      col8
count  5.000000   5.000000   5.000000    5.000000   5.00000
mean   3.000000  47.200000   8.000000   66.000000  11.00000
std    1.581139  14.342245   1.581139   25.367302   9.66954
min    1.000000  34.000000   6.000000   36.000000   1.00000
25%    2.000000  34.000000   7.000000   49.000000   4.00000
50%    3.000000  45.000000   8.000000   64.000000   9.00000
75%    4.000000  56.000000   9.000000   81.000000  16.00000
max    5.000000  67.000000  10.000000  100.000000  25.00000

In [23]:
df['col10'] = df['col7']

In [ ]:
df ['col_9'] = df['col1'*'col4'].apply(test2)

In [ ]:
df = pd.Dataframe(data=np,arenge(0,20).reshape(5,4)index=["Raw1"],["Raw2"],["Raw3"]),columans ["columans1"],["columans2"],["columans3"]

In [ ]:
array=([1 , 2 , 3]
       [3, 4, 5]
       [6, 7, 8])